---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedRowsFrom
source: html/16812319-e725-629c-8cc7-10479ae7e2d9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedRowsFrom Property

"Segment Start in Viewport"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewGraphSchedRowsFrom { get; }
```